{
  "class_name": "Model",
  "config": {
    "name": "model",
    "layers": [
      {
        "name": "image",
        "class_name": "InputLayer",
        "config": {
          "batch_input_shape": [
            null,
            null,
            null,
            3
          ],
          "dtype": "float32",
          "sparse": false,
          "name": "image"
        },
        "inbound_nodes": []
      },
      {
        "name": "average_pooling2d",
        "class_name": "AveragePooling2D",
        "config": {
          "name": "average_pooling2d",
          "trainable": true,
          "dtype": "float32",
          "pool_size": [
            2,
            2
          ],
          "padding": "valid",
          "strides": [
            2,
            2
          ],
          "data_format": "channels_last"
        },
        "inbound_nodes": [
          [
            "image",
            0,
            0,
            {}
          ]
        ]
      },
      {
        "name": "batch_normalization_v1",
        "class_name": "BatchNormalizationV1",
        "config": {
          "name": "batch_normalization_v1",
          "trainable": true,
          "batch_input_shape": [
            null,
            null,
            null,
            3
          ],
          "dtype": "float32",
          "axis": [
            3
          ],
          "momentum": 0.99,
          "epsilon": 0.001,
          "center": true,
          "scale": true,
          "beta_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "gamma_initializer": {
            "class_name": "Ones",
            "config": {}
          },
          "moving_mean_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "moving_variance_initializer": {
            "class_name": "Ones",
            "config": {}
          },
          "beta_regularizer": null,
          "gamma_regularizer": null,
          "beta_constraint": null,
          "gamma_constraint": null
        },
        "inbound_nodes": [
          [
            "average_pooling2d",
            0,
            0,
            {}
          ]
        ]
      },
      {
        "name": "conv1",
        "class_name": "Conv2D",
        "config": {
          "name": "conv1",
          "trainable": true,
          "dtype": "float32",
          "filters": 1,
          "kernel_size": [
            3,
            3
          ],
          "strides": [
            1,
            1
          ],
          "padding": "same",
          "data_format": "channels_last",
          "dilation_rate": [
            1,
            1
          ],
          "activation": "relu",
          "use_bias": true,
          "kernel_initializer": {
            "class_name": "GlorotUniform",
            "config": {
              "seed": null
            }
          },
          "bias_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "kernel_regularizer": null,
          "bias_regularizer": null,
          "activity_regularizer": null,
          "kernel_constraint": null,
          "bias_constraint": null
        },
        "inbound_nodes": [
          [
            "batch_normalization_v1",
            0,
            0,
            {}
          ]
        ]
      },
      {
        "name": "squash",
        "class_name": "MaxPooling2D",
        "config": {
          "name": "squash",
          "trainable": true,
          "dtype": "float32",
          "pool_size": [
            1,
            4
          ],
          "padding": "valid",
          "strides": [
            1,
            4
          ],
          "data_format": "channels_last"
        },
        "inbound_nodes": [
          [
            "conv1",
            0,
            0,
            {}
          ]
        ]
      },
      {
        "name": "conv2",
        "class_name": "Conv2D",
        "config": {
          "name": "conv2",
          "trainable": true,
          "dtype": "float32",
          "filters": 8,
          "kernel_size": [
            4,
            8
          ],
          "strides": [
            1,
            1
          ],
          "padding": "same",
          "data_format": "channels_last",
          "dilation_rate": [
            1,
            1
          ],
          "activation": "relu",
          "use_bias": true,
          "kernel_initializer": {
            "class_name": "VarianceScaling",
            "config": {
              "scale": 2.0,
              "mode": "fan_in",
              "distribution": "truncated_normal",
              "seed": null
            }
          },
          "bias_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "kernel_regularizer": null,
          "bias_regularizer": null,
          "activity_regularizer": {
            "class_name": "L1L2",
            "config": {
              "l1": 9.999999747378752e-06,
              "l2": 0.0
            }
          },
          "kernel_constraint": null,
          "bias_constraint": null
        },
        "inbound_nodes": [
          [
            "squash",
            0,
            0,
            {}
          ]
        ]
      },
      {
        "name": "squash2",
        "class_name": "MaxPooling2D",
        "config": {
          "name": "squash2",
          "trainable": true,
          "dtype": "float32",
          "pool_size": [
            1,
            4
          ],
          "padding": "valid",
          "strides": [
            1,
            4
          ],
          "data_format": "channels_last"
        },
        "inbound_nodes": [
          [
            "conv2",
            0,
            0,
            {}
          ]
        ]
      },
      {
        "name": "max_along_dims_1",
        "class_name": "MaxAlongDims",
        "config": {
          "name": "max_along_dims_1",
          "trainable": true,
          "dtype": "float32",
          "dims": [
            2
          ]
        },
        "inbound_nodes": [
          [
            "squash2",
            0,
            0,
            {}
          ]
        ]
      },
      {
        "name": "detection",
        "class_name": "Conv1D",
        "config": {
          "name": "detection",
          "trainable": true,
          "dtype": "float32",
          "filters": 5,
          "kernel_size": [
            25
          ],
          "strides": [
            1
          ],
          "padding": "same",
          "data_format": "channels_last",
          "dilation_rate": [
            1
          ],
          "activation": "relu",
          "use_bias": true,
          "kernel_initializer": {
            "class_name": "GlorotUniform",
            "config": {
              "seed": null
            }
          },
          "bias_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "kernel_regularizer": null,
          "bias_regularizer": null,
          "activity_regularizer": null,
          "kernel_constraint": null,
          "bias_constraint": null
        },
        "inbound_nodes": [
          [
            "max_along_dims_1",
            0,
            0,
            {}
          ]
        ]
      },
      {
        "name": "time_distributed",
        "class_name": "TimeDistributed",
        "config": {
          "name": "time_distributed",
          "trainable": true,
          "dtype": "float32",
          "layer": {
            "class_name": "Dense",
            "config": {
              "name": "dense",
              "trainable": true,
              "dtype": "float32",
              "units": 1,
              "activation": "sigmoid",
              "use_bias": true,
              "kernel_initializer": {
                "class_name": "GlorotUniform",
                "config": {
                  "seed": null
                }
              },
              "bias_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "kernel_regularizer": null,
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null
            }
          }
        },
        "inbound_nodes": [
          [
            "detection",
            0,
            0,
            {}
          ]
        ]
      },
      {
        "name": "squeeze_1",
        "class_name": "Squeeze",
        "config": {
          "name": "squeeze_1",
          "trainable": true,
          "dtype": "float32",
          "axis": -1
        },
        "inbound_nodes": [
          [
            "time_distributed",
            0,
            0,
            {}
          ]
        ]
      }
    ],
    "input_layers": [
      "image",
      0,
      0
    ],
    "output_layers": [
      "squeeze_1",
      0,
      0
    ]
  },
  "keras_version": "2.2.4-tf",
  "backend": "tensorflow"
}
