{"class_name": "Model", "config": {"name": "model", "layers": [{"name": "images", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 51, 51, 3], "dtype": "float32", "sparse": false, "name": "images"}, "inbound_nodes": []}, {"name": "bg_r2rgb", "class_name": "BGR2RGB", "config": {"name": "bg_r2rgb", "trainable": true, "dtype": "float32"}, "inbound_nodes": [[["images", 0, 0, {}]]]}, {"name": "reshape", "class_name": "Reshape", "config": {"name": "reshape", "trainable": true, "dtype": "float32", "target_shape": [7803]}, "inbound_nodes": [[["bg_r2rgb", 0, 0, {}]]]}, {"name": "byte_to_float", "class_name": "ByteToFloat", "config": {"name": "byte_to_float", "trainable": true, "dtype": "float32"}, "inbound_nodes": [[["reshape", 0, 0, {}]]]}, {"name": "fc1", "class_name": "Dense", "config": {"name": "fc1", "trainable": true, "dtype": "float32", "units": 10, "activation": "softmax", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["byte_to_float", 0, 0, {}]]]}], "input_layers": [["images", 0, 0]], "output_layers": [["fc1", 0, 0]]}, "keras_version": "2.2.4-tf", "backend": "tensorflow"}