{
  "class_name": "Model",
  "config": {
    "name": "model",
    "layers": [
      {
        "class_name": "InputLayer",
        "config": {
          "batch_input_shape": [
            null,
            50,
            null,
            3
          ],
          "dtype": "float32",
          "sparse": false,
          "ragged": false,
          "name": "image"
        },
        "name": "image",
        "inbound_nodes": []
      },
      {
        "class_name": "BatchNormalization",
        "config": {
          "name": "image/batchnorm",
          "trainable": false,
          "dtype": "float32",
          "axis": [
            3
          ],
          "momentum": 0.99,
          "epsilon": 0.001,
          "center": true,
          "scale": true,
          "beta_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "gamma_initializer": {
            "class_name": "Ones",
            "config": {}
          },
          "moving_mean_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "moving_variance_initializer": {
            "class_name": "Ones",
            "config": {}
          },
          "beta_regularizer": null,
          "gamma_regularizer": null,
          "beta_constraint": null,
          "gamma_constraint": null
        },
        "name": "image/batchnorm",
        "inbound_nodes": [
          [
            [
              "image",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "class_name": "Conv2D",
        "config": {
          "name": "shared_0/conv2d",
          "trainable": false,
          "dtype": "float32",
          "filters": 8,
          "kernel_size": [
            5,
            5
          ],
          "strides": [
            1,
            1
          ],
          "padding": "valid",
          "data_format": "channels_last",
          "dilation_rate": [
            1,
            1
          ],
          "activation": "linear",
          "use_bias": true,
          "kernel_initializer": {
            "class_name": "VarianceScaling",
            "config": {
              "scale": 2.0,
              "mode": "fan_in",
              "distribution": "truncated_normal",
              "seed": null
            }
          },
          "bias_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "kernel_regularizer": null,
          "bias_regularizer": null,
          "activity_regularizer": null,
          "kernel_constraint": null,
          "bias_constraint": null
        },
        "name": "shared_0/conv2d",
        "inbound_nodes": [
          [
            [
              "image/batchnorm",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "class_name": "BatchNormalization",
        "config": {
          "name": "shared_0/batchnorm",
          "trainable": false,
          "dtype": "float32",
          "axis": [
            3
          ],
          "momentum": 0.99,
          "epsilon": 0.001,
          "center": true,
          "scale": true,
          "beta_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "gamma_initializer": {
            "class_name": "Ones",
            "config": {}
          },
          "moving_mean_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "moving_variance_initializer": {
            "class_name": "Ones",
            "config": {}
          },
          "beta_regularizer": null,
          "gamma_regularizer": null,
          "beta_constraint": null,
          "gamma_constraint": null
        },
        "name": "shared_0/batchnorm",
        "inbound_nodes": [
          [
            [
              "shared_0/conv2d",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "class_name": "Conv2D",
        "config": {
          "name": "shared_1/conv2d",
          "trainable": false,
          "dtype": "float32",
          "filters": 50,
          "kernel_size": [
            42,
            4
          ],
          "strides": [
            1,
            1
          ],
          "padding": "valid",
          "data_format": "channels_last",
          "dilation_rate": [
            1,
            1
          ],
          "activation": "linear",
          "use_bias": true,
          "kernel_initializer": {
            "class_name": "VarianceScaling",
            "config": {
              "scale": 2.0,
              "mode": "fan_in",
              "distribution": "truncated_normal",
              "seed": null
            }
          },
          "bias_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "kernel_regularizer": null,
          "bias_regularizer": null,
          "activity_regularizer": null,
          "kernel_constraint": null,
          "bias_constraint": null
        },
        "name": "shared_1/conv2d",
        "inbound_nodes": [
          [
            [
              "shared_0/batchnorm",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "class_name": "MaxAlongDims",
        "config": {
          "name": "shared_1/max_along_dims",
          "trainable": false,
          "dtype": "float32",
          "dims": [
            1
          ]
        },
        "name": "shared_1/max_along_dims",
        "inbound_nodes": [
          [
            [
              "shared_1/conv2d",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "class_name": "Permute",
        "config": {
          "name": "shared_1/permute",
          "trainable": false,
          "dtype": "float32",
          "dims": [
            2,
            1
          ]
        },
        "name": "shared_1/permute",
        "inbound_nodes": [
          [
            [
              "shared_1/max_along_dims",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "class_name": "ExpandDims",
        "config": {
          "name": "shared_1/expand_dims",
          "trainable": false,
          "dtype": "float32",
          "axis": -1
        },
        "name": "shared_1/expand_dims",
        "inbound_nodes": [
          [
            [
              "shared_1/permute",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "class_name": "BatchNormalization",
        "config": {
          "name": "shared_1/batchnorm",
          "trainable": false,
          "dtype": "float32",
          "axis": [
            3
          ],
          "momentum": 0.99,
          "epsilon": 0.001,
          "center": true,
          "scale": true,
          "beta_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "gamma_initializer": {
            "class_name": "Ones",
            "config": {}
          },
          "moving_mean_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "moving_variance_initializer": {
            "class_name": "Ones",
            "config": {}
          },
          "beta_regularizer": null,
          "gamma_regularizer": null,
          "beta_constraint": null,
          "gamma_constraint": null
        },
        "name": "shared_1/batchnorm",
        "inbound_nodes": [
          [
            [
              "shared_1/expand_dims",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "class_name": "MaxPooling2D",
        "config": {
          "name": "heroes_hidden/input_maxpool",
          "trainable": false,
          "dtype": "float32",
          "pool_size": [
            1,
            3
          ],
          "padding": "valid",
          "strides": [
            1,
            3
          ],
          "data_format": "channels_last"
        },
        "name": "heroes_hidden/input_maxpool",
        "inbound_nodes": [
          [
            [
              "shared_1/batchnorm",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "class_name": "MaxPooling2D",
        "config": {
          "name": "assists_hidden/input_maxpool",
          "trainable": false,
          "dtype": "float32",
          "pool_size": [
            1,
            3
          ],
          "padding": "valid",
          "strides": [
            1,
            3
          ],
          "data_format": "channels_last"
        },
        "name": "assists_hidden/input_maxpool",
        "inbound_nodes": [
          [
            [
              "shared_1/batchnorm",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "class_name": "MaxPooling2D",
        "config": {
          "name": "abilities_hidden/input_maxpool",
          "trainable": false,
          "dtype": "float32",
          "pool_size": [
            1,
            4
          ],
          "padding": "valid",
          "strides": [
            1,
            4
          ],
          "data_format": "channels_last"
        },
        "name": "abilities_hidden/input_maxpool",
        "inbound_nodes": [
          [
            [
              "shared_1/batchnorm",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "class_name": "Conv2D",
        "config": {
          "name": "text_hidden/conv2d",
          "trainable": false,
          "dtype": "float32",
          "filters": 64,
          "kernel_size": [
            50,
            15
          ],
          "strides": [
            1,
            1
          ],
          "padding": "valid",
          "data_format": "channels_last",
          "dilation_rate": [
            1,
            1
          ],
          "activation": "relu",
          "use_bias": true,
          "kernel_initializer": {
            "class_name": "VarianceScaling",
            "config": {
              "scale": 2.0,
              "mode": "fan_in",
              "distribution": "truncated_normal",
              "seed": null
            }
          },
          "bias_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "kernel_regularizer": null,
          "bias_regularizer": null,
          "activity_regularizer": null,
          "kernel_constraint": null,
          "bias_constraint": null
        },
        "name": "text_hidden/conv2d",
        "inbound_nodes": [
          [
            [
              "shared_1/batchnorm",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "class_name": "Conv2D",
        "config": {
          "name": "heroes_hidden/conv2d",
          "trainable": false,
          "dtype": "float32",
          "filters": 16,
          "kernel_size": [
            50,
            12
          ],
          "strides": [
            1,
            1
          ],
          "padding": "valid",
          "data_format": "channels_last",
          "dilation_rate": [
            1,
            1
          ],
          "activation": "relu",
          "use_bias": true,
          "kernel_initializer": {
            "class_name": "VarianceScaling",
            "config": {
              "scale": 2.0,
              "mode": "fan_in",
              "distribution": "truncated_normal",
              "seed": null
            }
          },
          "bias_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "kernel_regularizer": null,
          "bias_regularizer": null,
          "activity_regularizer": null,
          "kernel_constraint": null,
          "bias_constraint": null
        },
        "name": "heroes_hidden/conv2d",
        "inbound_nodes": [
          [
            [
              "heroes_hidden/input_maxpool",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "class_name": "Conv2D",
        "config": {
          "name": "assists_hidden/conv2d",
          "trainable": false,
          "dtype": "float32",
          "filters": 8,
          "kernel_size": [
            50,
            7
          ],
          "strides": [
            1,
            1
          ],
          "padding": "valid",
          "data_format": "channels_last",
          "dilation_rate": [
            1,
            1
          ],
          "activation": "relu",
          "use_bias": true,
          "kernel_initializer": {
            "class_name": "VarianceScaling",
            "config": {
              "scale": 2.0,
              "mode": "fan_in",
              "distribution": "truncated_normal",
              "seed": null
            }
          },
          "bias_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "kernel_regularizer": null,
          "bias_regularizer": null,
          "activity_regularizer": null,
          "kernel_constraint": null,
          "bias_constraint": null
        },
        "name": "assists_hidden/conv2d",
        "inbound_nodes": [
          [
            [
              "assists_hidden/input_maxpool",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "class_name": "Conv2D",
        "config": {
          "name": "abilities_hidden/conv2d",
          "trainable": false,
          "dtype": "float32",
          "filters": 64,
          "kernel_size": [
            50,
            15
          ],
          "strides": [
            1,
            1
          ],
          "padding": "valid",
          "data_format": "channels_last",
          "dilation_rate": [
            1,
            1
          ],
          "activation": "relu",
          "use_bias": true,
          "kernel_initializer": {
            "class_name": "VarianceScaling",
            "config": {
              "scale": 2.0,
              "mode": "fan_in",
              "distribution": "truncated_normal",
              "seed": null
            }
          },
          "bias_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "kernel_regularizer": null,
          "bias_regularizer": null,
          "activity_regularizer": null,
          "kernel_constraint": null,
          "bias_constraint": null
        },
        "name": "abilities_hidden/conv2d",
        "inbound_nodes": [
          [
            [
              "abilities_hidden/input_maxpool",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "class_name": "MaxPooling2D",
        "config": {
          "name": "text_hidden/output_maxpool",
          "trainable": false,
          "dtype": "float32",
          "pool_size": [
            1,
            2
          ],
          "padding": "valid",
          "strides": [
            1,
            2
          ],
          "data_format": "channels_last"
        },
        "name": "text_hidden/output_maxpool",
        "inbound_nodes": [
          [
            [
              "text_hidden/conv2d",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "class_name": "MaxPooling2D",
        "config": {
          "name": "heroes_hidden/output_maxpool",
          "trainable": false,
          "dtype": "float32",
          "pool_size": [
            1,
            5
          ],
          "padding": "valid",
          "strides": [
            1,
            5
          ],
          "data_format": "channels_last"
        },
        "name": "heroes_hidden/output_maxpool",
        "inbound_nodes": [
          [
            [
              "heroes_hidden/conv2d",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "class_name": "MaxPooling2D",
        "config": {
          "name": "assists_hidden/output_maxpool",
          "trainable": false,
          "dtype": "float32",
          "pool_size": [
            1,
            5
          ],
          "padding": "valid",
          "strides": [
            1,
            5
          ],
          "data_format": "channels_last"
        },
        "name": "assists_hidden/output_maxpool",
        "inbound_nodes": [
          [
            [
              "assists_hidden/conv2d",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "class_name": "MaxPooling2D",
        "config": {
          "name": "abilities_hidden/output_maxpool",
          "trainable": false,
          "dtype": "float32",
          "pool_size": [
            1,
            10
          ],
          "padding": "valid",
          "strides": [
            1,
            10
          ],
          "data_format": "channels_last"
        },
        "name": "abilities_hidden/output_maxpool",
        "inbound_nodes": [
          [
            [
              "abilities_hidden/conv2d",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "class_name": "Squeeze",
        "config": {
          "name": "text_hidden/squeeze",
          "trainable": false,
          "dtype": "float32",
          "axis": 1
        },
        "name": "text_hidden/squeeze",
        "inbound_nodes": [
          [
            [
              "text_hidden/output_maxpool",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "class_name": "Squeeze",
        "config": {
          "name": "heroes_hidden/squeeze",
          "trainable": false,
          "dtype": "float32",
          "axis": 1
        },
        "name": "heroes_hidden/squeeze",
        "inbound_nodes": [
          [
            [
              "heroes_hidden/output_maxpool",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "class_name": "Squeeze",
        "config": {
          "name": "assists_hidden/squeeze",
          "trainable": false,
          "dtype": "float32",
          "axis": 1
        },
        "name": "assists_hidden/squeeze",
        "inbound_nodes": [
          [
            [
              "assists_hidden/output_maxpool",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "class_name": "Squeeze",
        "config": {
          "name": "abilities_hidden/squeeze",
          "trainable": false,
          "dtype": "float32",
          "axis": 1
        },
        "name": "abilities_hidden/squeeze",
        "inbound_nodes": [
          [
            [
              "abilities_hidden/output_maxpool",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "class_name": "BatchNormalization",
        "config": {
          "name": "text_hidden/batchnorm",
          "trainable": false,
          "dtype": "float32",
          "axis": [
            2
          ],
          "momentum": 0.99,
          "epsilon": 0.001,
          "center": true,
          "scale": true,
          "beta_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "gamma_initializer": {
            "class_name": "Ones",
            "config": {}
          },
          "moving_mean_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "moving_variance_initializer": {
            "class_name": "Ones",
            "config": {}
          },
          "beta_regularizer": null,
          "gamma_regularizer": null,
          "beta_constraint": null,
          "gamma_constraint": null
        },
        "name": "text_hidden/batchnorm",
        "inbound_nodes": [
          [
            [
              "text_hidden/squeeze",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "class_name": "BatchNormalization",
        "config": {
          "name": "heroes_hidden/batchnorm",
          "trainable": false,
          "dtype": "float32",
          "axis": [
            2
          ],
          "momentum": 0.99,
          "epsilon": 0.001,
          "center": true,
          "scale": true,
          "beta_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "gamma_initializer": {
            "class_name": "Ones",
            "config": {}
          },
          "moving_mean_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "moving_variance_initializer": {
            "class_name": "Ones",
            "config": {}
          },
          "beta_regularizer": null,
          "gamma_regularizer": null,
          "beta_constraint": null,
          "gamma_constraint": null
        },
        "name": "heroes_hidden/batchnorm",
        "inbound_nodes": [
          [
            [
              "heroes_hidden/squeeze",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "class_name": "BatchNormalization",
        "config": {
          "name": "assists_hidden/batchnorm",
          "trainable": false,
          "dtype": "float32",
          "axis": [
            2
          ],
          "momentum": 0.99,
          "epsilon": 0.001,
          "center": true,
          "scale": true,
          "beta_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "gamma_initializer": {
            "class_name": "Ones",
            "config": {}
          },
          "moving_mean_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "moving_variance_initializer": {
            "class_name": "Ones",
            "config": {}
          },
          "beta_regularizer": null,
          "gamma_regularizer": null,
          "beta_constraint": null,
          "gamma_constraint": null
        },
        "name": "assists_hidden/batchnorm",
        "inbound_nodes": [
          [
            [
              "assists_hidden/squeeze",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "class_name": "BatchNormalization",
        "config": {
          "name": "abilities_hidden/batchnorm",
          "trainable": false,
          "dtype": "float32",
          "axis": [
            2
          ],
          "momentum": 0.99,
          "epsilon": 0.001,
          "center": true,
          "scale": true,
          "beta_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "gamma_initializer": {
            "class_name": "Ones",
            "config": {}
          },
          "moving_mean_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "moving_variance_initializer": {
            "class_name": "Ones",
            "config": {}
          },
          "beta_regularizer": null,
          "gamma_regularizer": null,
          "beta_constraint": null,
          "gamma_constraint": null
        },
        "name": "abilities_hidden/batchnorm",
        "inbound_nodes": [
          [
            [
              "abilities_hidden/squeeze",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "class_name": "TimeDistributed",
        "config": {
          "name": "text",
          "trainable": false,
          "dtype": "float32",
          "layer": {
            "class_name": "Dense",
            "config": {
              "name": "text/dense",
              "trainable": false,
              "dtype": "float32",
              "units": 36,
              "activation": "linear",
              "use_bias": true,
              "kernel_initializer": {
                "class_name": "GlorotUniform",
                "config": {
                  "seed": null
                }
              },
              "bias_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "kernel_regularizer": null,
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null
            }
          }
        },
        "name": "text",
        "inbound_nodes": [
          [
            [
              "text_hidden/batchnorm",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "class_name": "TimeDistributed",
        "config": {
          "name": "heroes",
          "trainable": false,
          "dtype": "float32",
          "layer": {
            "class_name": "Dense",
            "config": {
              "name": "heroes/dense",
              "trainable": false,
              "dtype": "float32",
              "units": 34,
              "activation": "linear",
              "use_bias": true,
              "kernel_initializer": {
                "class_name": "GlorotUniform",
                "config": {
                  "seed": null
                }
              },
              "bias_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "kernel_regularizer": null,
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null
            }
          }
        },
        "name": "heroes",
        "inbound_nodes": [
          [
            [
              "heroes_hidden/batchnorm",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "class_name": "TimeDistributed",
        "config": {
          "name": "assists",
          "trainable": false,
          "dtype": "float32",
          "layer": {
            "class_name": "Dense",
            "config": {
              "name": "assists/dense",
              "trainable": false,
              "dtype": "float32",
              "units": 17,
              "activation": "linear",
              "use_bias": true,
              "kernel_initializer": {
                "class_name": "GlorotUniform",
                "config": {
                  "seed": null
                }
              },
              "bias_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "kernel_regularizer": null,
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null
            }
          }
        },
        "name": "assists",
        "inbound_nodes": [
          [
            [
              "assists_hidden/batchnorm",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "class_name": "TimeDistributed",
        "config": {
          "name": "abilities",
          "trainable": false,
          "dtype": "float32",
          "layer": {
            "class_name": "Dense",
            "config": {
              "name": "abilities/dense",
              "trainable": false,
              "dtype": "float32",
              "units": 61,
              "activation": "linear",
              "use_bias": true,
              "kernel_initializer": {
                "class_name": "GlorotUniform",
                "config": {
                  "seed": null
                }
              },
              "bias_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "kernel_regularizer": null,
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null
            }
          }
        },
        "name": "abilities",
        "inbound_nodes": [
          [
            [
              "abilities_hidden/batchnorm",
              0,
              0,
              {}
            ]
          ]
        ]
      }
    ],
    "input_layers": [
      [
        "image",
        0,
        0
      ]
    ],
    "output_layers": [
      [
        "text",
        0,
        0
      ],
      [
        "heroes",
        0,
        0
      ],
      [
        "assists",
        0,
        0
      ],
      [
        "abilities",
        0,
        0
      ]
    ]
  },
  "keras_version": "2.2.4-tf",
  "backend": "tensorflow"
}